// #include <stdio.h>
// int main() {
//     int arr1[][2] = {{20, 10}, {18, 9}}; //可以看到，数组里面存放了数组   //前面的[]是外层的数组，后一个[]是内层的数组
//     // 存放的内层数组的长度是需要确定的，存放数组的数组和之前一样，可以根据后面的值决定
//
//     // 二维数组：存放数组的数组
//     int arr2[3][12] = { {31, 29, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31}, //2020年是闰年，2月有29天
//                         {31, 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31},
//                         {31, 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31}};
// }

// 那么如何得到呢?
#include <stdio.h>

int main() {
    int arr[3][12] = { {31, 29, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31}, //2020年是闰年，2月有29天
                        {31, 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31}, //2021
                        {31, 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31}}; //2022
    printf("%d\n", arr[0][1]); //访问第一个数组的第二个数（下标从0开始）
    printf("%d\n", arr[1][4]); //2021.5

    //自然也能上升到三维、四维
    int arr3[2][2][2] = {{{1, 2}, {1, 2}},{{1, 2}, {1, 2}}};
}