#include <stdio.h>

int main() {
    // int a = 10;
    // a *= 2;
    // printf("%d", a);
    //输出20

    //左移运算
    // int a = 10;
    // a = a << 1; //等效 a <<= 1;
    // printf("%d", a);

    //同样输出20
    // <<表示让所有的bit位进行左移操作， <<1就是左移1位
    //默认用二进制， 10 == 000001010 左挪一位，得000010100 == 20
    //十进制:00005 -> 00050 -> 00500
    //规律：对于R进制，每左移一次乘一次R, 左移n次即乘R * n

    //右移运算
    //同理
    // int a = 10;
    // a >>= 1;  //10 == 000001010，右移一位，得000000101 == 5
    // printf("%d", a);
    //输出5
    //右移与左移相反，对于R进制，等效每右移一次除以一次R，右移n次即除R * n

    //按位与操作
    // int a = 6, b = 4;
    // int c = a & b;  //按位与操作
    // printf("c = %d",c);
    // a = 6 == 00000110 , b = 4 == 00000100
    //按位就是让两个数的每个位进行比较，如果两个数对应Bit位都是1，那么结果对应bit位上就是1，否则一律为0
    //可以理解为“与”
    //因此，结果为：00000100 = 4

    //按位或运算
    // int a = 6, b = 4;
    // int c = a | b;
    // printf("c = %d", c);
    //同理，只要有一位是1，那么就是1
    //参考“或”
    //因此，结果为，00000110 = 6

    //异或和按位非
    int a = 6, b = 4;
    int c = a ^ b;  //注意^不是指数运算，表示按位异或运算,让两个数的第一位都进行比较，如果两个数对应bit位上不同时为1或
    //是不同时为0，那么结果就是1，否则结果就是0，所以这里的结果就是2 == 00000010
    // 简略一下，一样就是0，否则就是1
    printf("c = %d",c);

    a = ~a;  //按位否定针对某个数进行操作，它会将这个数的每一个bit位都置反，0变成1，1变成0，猜猜会变几
    //a = 6 == 00000110,转换 -> 11111001 = -7 （此处为补码形式）
    printf("a = %d", a);
}
